Revit 2024 API
BuiltInFailures.PerformanceFailures.ClippingIsDisabled Property
 View has clipping disabled. It causes view to draw too many elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ClippingIsDisabled { get; }
Visual Basic
Public Shared ReadOnly Property ClippingIsDisabled As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ClippingIsDisabled {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace